In [ ]:
import seaborn as sns
import pandas as pd

# 타이타닉 데이터
titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age','fare']] # : 모든 행을 선
df.head() #상위 5개열 출력

# age 열에 각 나이에 10을 더하는 add_10() 함수를 적용하세요.
def add_10(n):
  return n+10
print(add_10(10))

# age 열에 람다 함수를 사용하여 모든 나이에 5를 곱하는 변환을 수행하세요.
times_5 = df['age'].apply(lambda x: x*5)
print("람다 함수 적용")
print(times_5)

# age와 fare 열에 동시에 최댓값과 최솟값의 차이를 계산하는 함수를 적용하세요.
def calculate(series): # series는 이 함수에 **외부에서 전달되는 1차원 데이터(Series)**를 받을 변수
  return pd.Series({
      'max': series.max(),
      'min': series.min()})

numeric_df = df[['age','fare']]
result_df = numeric_df.apply(lambda x: x.max()-x.min(), axis=1)
print("위의 함수 적용")
print(result_df)

20
람다 함수 적용
0      110.0
1      190.0
2      130.0
3      175.0
4      175.0
       ...
886    135.0
887     95.0
888      NaN
889    130.0
890    160.0
Name: age, Length: 891, dtype: float64
위의 함수 적용
0      14.7500
1      33.2833
2      18.0750
3      18.1000
4      26.9500
        ...
886    14.0000
887    11.0000
888     0.0000
889     4.0000
890    24.2500
Length: 891, dtype: float64

In [ ]:
# 미션 2: 시리즈 객체에 함수 매핑

# 각 열의 최댓값, 최솟값, 평균, 중앙값을 계산하는 calculate_stats() 함수를 생성하세요.
def calculate_stats(series):
  return pd.Series({
      'max': series.max(),
      'min': series.min(),
      'mean': series.mean(),
      'median': series.median()})

# 데이터프레임의 모든 열에 axis=0 옵션을 사용하여 위 함수를 적용하세요.
numeric_df = df[['age','fare']]
result_df = numeric_df.apply(calculate_stats, axis=0)
print("위의 함수 적용")
print(result_df)

# axis=1 옵션을 사용하여 각 행별로 최댓값과 최솟값의 차이를 구하세요.
result_sr = numeric_df.apply(lambda x: x.max()-x.min(),axis=1)
print("\n각 행의 최대값-최소값 차이:")
print(result_sr)

위의 함수 적용
              age        fare
max     80.000000  512.329200
min      0.420000    0.000000
mean    29.699118   32.204208
median  28.000000   14.454200

각 행의 최대값-최소값 차이:
0      14.7500
1      33.2833
2      18.0750
3      18.1000
4      26.9500
        ...
886    14.0000
887    11.0000
888     0.0000
889     4.0000
890    24.2500
Length: 891, dtype: float64

In [ ]:
# 미션 3: 조건식을 만족하는 열의 필터링

titanic = sns.load_dataset('titanic')

# 평균값이 30을 초과하는 열만 선택하여 새로운 데이터프레임을 생성하세요.
df['average_column'] = df.mean()
df['average_filter'] = df['average_column'] > 30
print(df['average_filter'])
# print(df)

# 각 행의 평균값이 50을 초과하지 않으면 'Low', 그렇지 않으면 'High'로 분류하는 새로운 열을 추가하세요.
#df['over_50'] = df.apply(lambda row: 'Low' if row['average_column'] < 50 else 'High')

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: average_filter, Length: 891, dtype: bool

In [ ]:
# 미션 4: 데이터프레임 객체에 함수 매핑

# 결측치를 중앙값으로 대체하는 함수를 생성하고 pipe()로 적용하세요.
titanic = sns.load_dataset('titanic')
df = titanic
df = titanic.loc[:, ['age','fare']]
print(df.isnull().sum())

def fillna_with_median(series):
    return series.fillna(series.median())
df2 = fillna_with_median(df)
print(df2.isnull().sum())

age     177
fare      0
dtype: int64
age     0
fare    0
dtype: int64

In [ ]:
# 미션 5: 열 순서 변경과 정렬

# 데이터프레임의 열 이름을 알파벳 순으로 정렬하세요.
titanic = sns.load_dataset('titanic')
df = titanic
df = titanic.loc[:, ['age','fare','sex','survived','pclass']]

columns_sorted = sorted(df,reverse=False) # 오름차순
print(columns_sorted)

# 역순으로 열을 배치한 후, 사용자 정의 순서(['survived', 'sex', 'pclass', 'age'])로 다시 정렬하세요.
columns_reverse = sorted(columns_sorted,reverse=True)
print(columns_reverse)

columns_customed = ['survived','sex','pclass','age']
df_customed = df[columns_customed]
print(df_customed)

# 열 분리: str.split()을 사용하여 날짜 데이터를 년, 월, 일로 분리하세요.
df2 = pd.read_excel('/content/drive/MyDrive/Colab Notebooks/data-set.xlsx',engine = 'openpyxl')
df2['연월일'] = df2['연월일'].astype('str')
dates = df2['연월일'].str.split('-')
dates.head()

['age', 'fare', 'pclass', 'sex', 'survived']
['survived', 'sex', 'pclass', 'fare', 'age']
     survived     sex  pclass   age
0           0    male       3  22.0
1           1  female       1  38.0
2           1  female       3  26.0
3           1  female       1  35.0
4           0    male       3  35.0
..        ...     ...     ...   ...
886         0    male       2  27.0
887         1  female       1  19.0
888         0  female       3   NaN
889         1    male       1  26.0
890         0    male       3  32.0

[891 rows x 4 columns]

0    [2018, 07, 02]
1    [2018, 06, 29]
2    [2018, 06, 28]
3    [2018, 06, 27]
4    [2018, 06, 26]
Name: 연월일, dtype: object

In [ ]:
# 미션 6: 그룹 연산과 집계

# class별로 그룹화하여 각 그룹의 데이터 개수와 평균 age, fare를 계산하세요.
titanic = sns.load_dataset('titanic')
df = titanic
df = titanic.loc[:, ['age','fare','class']]

grouped = df.groupby('class').agg({
    'mean': df['age'].mean()
    'mean2': df['fare'].mean()
})

SyntaxError: invalid syntax. Perhaps you forgot a comma? (<ipython-input-71-2573788784>, line 9)

In [ ]:
# 미션 9: 데이터프레임 연결과 병합

# 두 개의 데이터프레임을 concat()으로 수직 연결하되, ignore_index=True 옵션을 사용하세요
df1 = pd.read_excel('/content/drive/MyDrive/Colab Notebooks/stock_price.xlsx',engine = 'openpyxl')
df2 = pd.read_excel('/content/drive/MyDrive/Colab Notebooks/stock_valuation.xlsx',engine = 'openpyxl')

# 수직으로 연결
result1 = pd.concat([df1, df2], axis=0, ignore_index=True) # 기존의 인덱스 무시
print("\n수직 연결 결과:")
print(result1)

# Inner Join과 Outer Join을 각각 수행하여 결과를 비교하세요.
merge_inner = pd.merge(df1, df2, how='inner') # 공통된 열 이름을 기준으로 자동 조인
print("\nInner Join 결과:")
print(merge_inner)

merge_outer = pd.merge(df1, df2, how='outer') # df1과 df2의 열 이름 중 공통된 열 이름을 자동으로 기준(key)으로 사용, 일치하지 않는 곳은 NaN으로 채웁니다.
print("\nOuter Join 결과:")
print(merge_outer)

# 주식 가격 데이터와 재무 데이터를 id를 기준으로 병합하되, Left Join 방식을 사용하세요.
merge_left = pd.merge(df1, df2, on='id',how='left') #왼쪽(df1)의 모든 행을 유지하고, df2에 일치하는 값이 있으면 가져오고, 없으면 NaN으로 채움
print("\nLeft Join 결과:")
print(merge_left)

수직 연결 결과:
        id stock_name          value     price       name           eps  \
0   128940       한미약품   59385.666667  421000.0        NaN           NaN
1   130960     CJ E&M   58540.666667   98900.0        NaN           NaN
2   138250      엔에스쇼핑   14558.666667   13200.0        NaN           NaN
3   139480        이마트  239230.833333  254500.0        NaN           NaN
4   142280     녹십자엠에스     468.833333   10200.0        NaN           NaN
5   145990        삼양사   82750.000000   82000.0        NaN           NaN
6   185750        종근당   40293.666667  100500.0        NaN           NaN
7   192400      쿠쿠홀딩스  179204.666667  177500.0        NaN           NaN
8   199800         툴젠   -2514.333333  115400.0        NaN           NaN
9   204210     모두투어리츠    3093.333333    3475.0        NaN           NaN
10  130960        NaN            NaN       NaN     CJ E&M   6301.333333
11  136480        NaN            NaN       NaN         하림    274.166667
12  138040        NaN            NaN       NaN    메리츠금융지주   2122.333333
13  139480        NaN            NaN       NaN        이마트  18268.166667
14  145990        NaN            NaN       NaN        삼양사   5741.000000
15  161390        NaN            NaN       NaN      한국타이어   5648.500000
16  181710        NaN            NaN       NaN  NHN엔터테인먼트   2110.166667
17  185750        NaN            NaN       NaN        종근당   3990.333333
18  204210        NaN            NaN       NaN     모두투어리츠     85.166667
19  207940        NaN            NaN       NaN   삼성바이오로직스   4644.166667

         bps        per       pbr
0        NaN        NaN       NaN
1        NaN        NaN       NaN
2        NaN        NaN       NaN
3        NaN        NaN       NaN
4        NaN        NaN       NaN
5        NaN        NaN       NaN
6        NaN        NaN       NaN
7        NaN        NaN       NaN
8        NaN        NaN       NaN
9        NaN        NaN       NaN
10   54068.0  15.695091  1.829178
11    3551.0  11.489362  0.887074
12   14894.0   6.313806  0.899691
13  295780.0  13.931338  0.860437
14  108090.0  14.283226  0.758627
15   51341.0   7.453306  0.820007
16   78434.0  30.755864  0.827447
17   40684.0  25.185866  2.470259
18    5335.0  40.802348  0.651359
19   60099.0  89.790059  6.938551

Inner Join 결과:
       id stock_name          value   price    name           eps     bps  \
0  130960     CJ E&M   58540.666667   98900  CJ E&M   6301.333333   54068
1  139480        이마트  239230.833333  254500     이마트  18268.166667  295780
2  145990        삼양사   82750.000000   82000     삼양사   5741.000000  108090
3  185750        종근당   40293.666667  100500     종근당   3990.333333   40684
4  204210     모두투어리츠    3093.333333    3475  모두투어리츠     85.166667    5335

         per       pbr
0  15.695091  1.829178
1  13.931338  0.860437
2  14.283226  0.758627
3  25.185866  2.470259
4  40.802348  0.651359

Outer Join 결과:
        id stock_name          value     price       name           eps  \
0   128940       한미약품   59385.666667  421000.0        NaN           NaN
1   130960     CJ E&M   58540.666667   98900.0     CJ E&M   6301.333333
2   136480        NaN            NaN       NaN         하림    274.166667
3   138040        NaN            NaN       NaN    메리츠금융지주   2122.333333
4   138250      엔에스쇼핑   14558.666667   13200.0        NaN           NaN
5   139480        이마트  239230.833333  254500.0        이마트  18268.166667
6   142280     녹십자엠에스     468.833333   10200.0        NaN           NaN
7   145990        삼양사   82750.000000   82000.0        삼양사   5741.000000
8   161390        NaN            NaN       NaN      한국타이어   5648.500000
9   181710        NaN            NaN       NaN  NHN엔터테인먼트   2110.166667
10  185750        종근당   40293.666667  100500.0        종근당   3990.333333
11  192400      쿠쿠홀딩스  179204.666667  177500.0        NaN           NaN
12  199800         툴젠   -2514.333333  115400.0        NaN           NaN
13  204210     모두투어리츠    3093.333333    3475.0     모두투어리츠     85.166667
14  207940        NaN            NaN       NaN   삼성바이오로직스   4644.166667

         bps        per       pbr
0        NaN        NaN       NaN
1    54068.0  15.695091  1.829178
2     3551.0  11.489362  0.887074
3    14894.0   6.313806  0.899691
4        NaN        NaN       NaN
5   295780.0  13.931338  0.860437
6        NaN        NaN       NaN
7   108090.0  14.283226  0.758627
8    51341.0   7.453306  0.820007
9    78434.0  30.755864  0.827447
10   40684.0  25.185866  2.470259
11       NaN        NaN       NaN
12       NaN        NaN       NaN
13    5335.0  40.802348  0.651359
14   60099.0  89.790059  6.938551

Left Join 결과:
       id stock_name          value   price    name           eps       bps  \
0  128940       한미약품   59385.666667  421000     NaN           NaN       NaN
1  130960     CJ E&M   58540.666667   98900  CJ E&M   6301.333333   54068.0
2  138250      엔에스쇼핑   14558.666667   13200     NaN           NaN       NaN
3  139480        이마트  239230.833333  254500     이마트  18268.166667  295780.0
4  142280     녹십자엠에스     468.833333   10200     NaN           NaN       NaN
5  145990        삼양사   82750.000000   82000     삼양사   5741.000000  108090.0
6  185750        종근당   40293.666667  100500     종근당   3990.333333   40684.0
7  192400      쿠쿠홀딩스  179204.666667  177500     NaN           NaN       NaN
8  199800         툴젠   -2514.333333  115400     NaN           NaN       NaN
9  204210     모두투어리츠    3093.333333    3475  모두투어리츠     85.166667    5335.0

         per       pbr
0        NaN       NaN
1  15.695091  1.829178
2        NaN       NaN
3  13.931338  0.860437
4        NaN       NaN
5  14.283226  0.758627
6  25.185866  2.470259
7        NaN       NaN
8        NaN       NaN
9  40.802348  0.651359

In [ ]:
# 미션 10: 피벗 테이블과 스택/언스택

# class를 행, sex를 열, age를 값으로 하는 피벗 테이블을 생성하고 평균 집계를 적용하세요.
titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age','class','sex']]

pivot_df = df.pivot_table(
    index='class',
    columns='sex',
    values='age',
    aggfunc='mean'
)
#print(pivot_df)

# 위에서 생성한 피벗 테이블을 stack()과 unstack() 메소드로 형태를 변환하세요.
# 스택: 열을 행으로 변환
stacked = df.stack()
print("\n스택 결과 (열→행):")
print(stacked)

# 언스택: 행을 열로 변환
unstacked = stacked.unstack()
print("\n언스택 결과 (행→열):")
print(unstacked)

# melt() 함수를 사용하여 Wide 형태의 데이터를 Long 형태로 변환하세요.
melted_df = df.melt(
    id_vars='class', # 그대로 유지
    var_name='old', # 녹아내린 열
    value_name='mf' # 녹아내린 셀의 실제 값
)
print("\nMelt 결과 (Wide → Long):")
print(melted_df)

스택 결과 (열→행):
0    age       22.0
     class    Third
     sex       male
1    age       38.0
     class    First
              ...
889  class    First
     sex       male
890  age       32.0
     class    Third
     sex       male
Length: 2496, dtype: object

언스택 결과 (행→열):
      age   class     sex
0    22.0   Third    male
1    38.0   First  female
2    26.0   Third  female
3    35.0   First  female
4    35.0   Third    male
..    ...     ...     ...
886  27.0  Second    male
887  19.0   First  female
888   NaN   Third  female
889  26.0   First    male
890  32.0   Third    male

[891 rows x 3 columns]

Melt 결과 (Wide → Long):
       class  old      mf
0      Third  age    22.0
1      First  age    38.0
2      Third  age    26.0
3      First  age    35.0
4      Third  age    35.0
...      ...  ...     ...
1777  Second  sex    male
1778   First  sex  female
1779   Third  sex  female
1780   First  sex    male
1781   Third  sex    male

[1782 rows x 3 columns]

<ipython-input-103-2597533644>:7: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  pivot_df = df.pivot_table(